package math_sp

import (
	"fmt"
	"math"
)

// 常用数学常量:
const (
	E   = 2.71828182845904523536028747135266249775724709369995957496696763 // https://oeis.org/A001113
	Pi  = 3.14159265358979323846264338327950288419716939937510582097494459 // https://oeis.org/A000796
	Phi = 1.61803398874989484820458683436563811772030917980576286213544862 // https://oeis.org/A001622

	Sqrt2   = 1.41421356237309504880168872420969807856967187537694807317667974 // https://oeis.org/A002193
	SqrtE   = 1.64872127070012814684865078781416357165377610071014801157507931 // https://oeis.org/A019774
	SqrtPi  = 1.77245385090551602729816748334114518279754945612238712821380779 // https://oeis.org/A002161
	SqrtPhi = 1.27201964951406896425242246173749149171560804184009624861664038 // https://oeis.org/A139339

	Ln2    = 0.693147180559945309417232121458176568075500134360255254120680009 // https://oeis.org/A002162
	Log2E  = 1 / Ln2
	Ln10   = 2.30258509299404568401799145468436420760110148862877297603332790 // https://oeis.org/A002392
	Log10E = 1 / Ln10
)

// math.Max(a,b)	两数之间较大值
// math.Min(a,b)	两数之间较小值
// math.Abs(a)		绝对值
// math.Mod(a,b)	a%b余数
// math.Trunc(a)	取整
// math.Floor(a)	向下取整
// math.Ceil(a)		向上取整
// math.Round(a)	四舍五入
// math.Log(a)		取对数,这个API通常配合换底公式求除法:
func test() {
	fmt.Println(math.Log(100) / math.Log(10))
	fmt.Println(math.Log(1) / math.Log(2))
}

// math.Exp(a)		取e^(a)
// math.Pow(a,b)	取a^(b),当b是小数时可以拿来开N方
// math.Sqrt(a))	取平方根
// math.Cbrt(a)		取立方根
// math.Sin(a)
// math.Cos(a)
// math.Tan(a)
